---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.RebarBarType
source: html/b236c761-112c-454b-46e2-bb5a14fdb353.htm
---
# RebarBarType Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.